instagram/app/controllers/posts_controller.rb

    def index
        @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

    def create
        Post.create(post_params)
---
INSERT INTO "posts" ("caption", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["caption", "another test"], ["created_at", "2020-10-24 16:44:51.916927"], ["updated_at", "2020-10-24 16:44:51.916927"], ["user_id", 1]]